/// <summary>
/// Перечисление, описывающее категории товаров.
/// </summary>
public enum Category
{
    /// <summary>
    /// Техника (например, телевизоры, компьютеры).
    /// </summary>
    Electronics,

    /// <summary>
    /// Одежда (например, футболки, брюки).
    /// </summary>
    Clothing,

    /// <summary>
    /// Продукты питания (например, хлеб, молоко).
    /// </summary>
    Food,

    /// <summary>
    /// Мебель (например, столы, стулья).
    /// </summary>
    Furniture,

    /// <summary>
    /// Спортивные товары (например, мячи, тренажёры).
    /// </summary>
    Sports,

    /// <summary>
    /// Игрушки (например, куклы, конструкторы).
    /// </summary>
    Toys,

    /// <summary>
    /// Канцелярские товары (например, ручки, блокноты).
    /// </summary>
    Stationery
}
